
 [
    {
      "text": "Miss Javaria Zahra is an amazing psychologist. I felt a deep sense of security while talking to her. She dealt with me with so much love, care, and empathy. Her kind attitude made it easy for me to open up. She also provided me with helpful exercises that truly made a difference. I’m really happy and satisfied with my decision to choose her as my psychologist. Highly recommended!",
      "date": "21 Jul 2025"
    },
    {
      "text": "I am grateful to have met Javaria as my therapist. Javaria is empathetic, listens to understand and shows great congruence.\nShe has helped me gained clarity, self validation and the confidence to move to the next stage in loving and trusting myself foremost before expanding them to others.\nI am grateful to have learnt how to move forward with Javaria and highly recommend her to anyone who needs help with self awareness and validation.",
      "date": "11 Jul 2025"
    },
    {
      "text": "It was really wonderful experience with Zahra.",
      "date": "19 Jun 2025"
    },
    {
      "text": "Ms Javaria Zahra’s approach to us a a couple was very much to the point and helpful. She put a genuine effort to understand our problems as 16 years of husband and wife couple relationship with 2 kids. She made us to look at our problems from a different perspective and suggested some steps to make our relationship better so that we can have a better relationship with our 2 children.. We truly appreciate her support and advise her services.",
      "date": "18 Jun 2025"
    },
    {
      "text": "Ms Javaria Zahra helped me change my life around when i felt hopeless and in a dark place. She listened , understood me and helped me cope and i wouldnt be here today without her",
      "date": "17 Jun 2025"
    },
    {
      "text": "Ms Javeria brings a wealth of experience when it comes to mental health wellbeing. She listens carefully and explains way on improving mental health one small step at a time.",
      "date": "10 Jun 2025"
    },
    {
      "text": "I was astonished by this experience since it literally saved my life , thank you so much miss Javaria❤️",
      "date": "12 Mar 2025"
    },
    {
      "text": "I can’t express enough gratitude for Dr. J and the impact she has had on my life. From the very first session, she created a space where I felt completely safe, heard, and understood. There was never any judgment—just warmth, empathy, and an incredible ability to make even the most overwhelming emotions feel manageable.\n\nOver the past five sessions, I’ve noticed real changes in myself. I’ve become more self-aware, more patient with my emotions, and more capable of navigating my triggers in a healthier way. One thing she said that really stuck with me was that healing isn’t about erasing pain, but about learning to sit with it without letting it define me. \n\nWhat I appreciate most about Dr.J is that she doesn’t just give advice; she asks the right questions, the kind that make you pause, reflect, and truly understand yourself better. Her approach is supportive yet empowering, and I always leave our sessions feeling lighter, clearer, and more equipped to handle life’s challenges.\n\nIf you’re looking for a counselor who truly cares, who listens deeply, and who gently guides you toward growth and healing, I can’t recommend Dr.J enough. She has been such a blessing in my journey, and I know she will be for so many others too.",
      "date": "26 Feb 2025"
    },
    {
      "text": "It was an amazing time with Zahara, who has helped me find my strength and self-awareness. Zahara has taught me numerous ways to navigate and alleviate my pain. I truly appreciated her intelligence, openness, motivation, and powerful words. Her insightful and supportive nature has been instrumental in my journey.",
      "date": "03 Feb 2025"
    },
    {
      "text": "I was at a really low point in life when I met her. But she not only changed my perspective but also encouraged me in ways where today I am back to being my confident self. \n\nThanks Javeria!",
      "date": "08 Jan 2025"
    }
  ]
